Repository: datakurre/ploneconf2017
Catalog: resources/theme/demotheme/locales/*/LC_MESSAGES/plone.po
Languages: fi

source: Close from submissions
fi: Sulje osallistuminen

source: Image
fi: Kuva

source: Open for submissions
fi: Avaa osallistumiselle

source: Submit new image
fi: Ehdota uutta kuvaa

source: Thank you for your submission! It will be reviewed soon.
fi: Kiitos osallistumisestasi! Kuvasi tarkastetaan pian.

source: Title
fi: Nimike

source: Visitor submitted image for wall of images
fi: Kävijän kuva kuvaseinälle

source: Wall of Images
fi: Kuvaseinä

source: Wall of Images image
fi: Kuvaseinän kuva

source: Wall of approved visitor submitted images
fi: Seinällinen käviöiden lähettämiä kuvia
